<?php

declare (strict_types = 1);

namespace app\common\model\manage;

use think\Model;

class Link extends Model
{
    // +----------------------------------------------------------------------
    // | 定义数据表名称
    // +----------------------------------------------------------------------

    protected $name = 'link';
    
    // 模型中文名称
    public static $chineseName = '友情链接';

    // +----------------------------------------------------------------------
    // | 追加字段
    // +----------------------------------------------------------------------

    protected $append = [
        'title',
    ];

    // +----------------------------------------------------------------------
    // | 类型获取器
    // +----------------------------------------------------------------------

    public function getTypeAttr($value)
    {
        $type = [
            2 => '图片链接',
            1 => '文字链接', 
        ];
        return $type[$value];
    }
}
